Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [3]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-01-22 03:56:26--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.242.30
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.242.30|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  44.7MB/s    in 4.8s

2020-01-22 03:56:31 (40.6 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [4]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [5]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [6]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [7]:
##### YOUR CODE HERE #####
! head products.csv

product_id,product_name,aisle_id,department_id
1,Chocolate Sandwich Cookies,61,19
2,All-Seasons Salt,104,13
3,Robust Golden Unsweetened Oolong Tea,94,7
4,Smart Ones Classic Favorites Mini Rigatoni With Vodka Cream Sauce,38,1
5,Green Chile Anytime Sauce,5,13
6,Dry Nose Oil,11,11
7,Pure Coconut Water With Orange,98,7
8,Cut Russet Potatoes Steam N' Mash,116,1
9,Light Strawberry Blueberry Yogurt,120,16

In [8]:
! head orders.csv

order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2539329,1,prior,1,2,08,
2398795,1,prior,2,3,07,15.0
473747,1,prior,3,3,12,21.0
2254736,1,prior,4,4,07,29.0
431534,1,prior,5,4,15,28.0
3367565,1,prior,6,2,07,19.0
550135,1,prior,7,1,09,20.0
3108588,1,prior,8,1,14,14.0
2295261,1,prior,9,1,16,0.0

In [9]:
! head order_products__prior.csv

order_id,product_id,add_to_cart_order,reordered
2,33120,1,1
2,28985,2,1
2,9327,3,0
2,45918,4,1
2,30035,5,0
2,17794,6,1
2,40141,7,1
2,1819,8,1
2,43668,9,0

In [10]:
! head order_products__train.csv

order_id,product_id,add_to_cart_order,reordered
1,49302,1,1
1,11109,2,1
1,10246,3,0
1,49683,4,0
1,43633,5,1
1,13176,6,0
1,47209,7,0
1,22035,8,1
36,39612,1,0

I'll need to concat the order_products tables, then reference the table of product names vs IDs in order to compile the list of popular products.

In [0]:
import pandas as pd
import numpy as np

In [0]:
opp_df = pd.read_csv('order_products__prior.csv')

In [13]:
opp_df.head(10)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0
5         2       17794                  6          1
6         2       40141                  7          1
7         2        1819                  8          1
8         2       43668                  9          0
9         3       33754                  1          1

In [0]:
opt_df = pd.read_csv('order_products__train.csv')

In [15]:
order_products = pd.concat([opp_df, opt_df])
order_products.shape

(33819106, 4)

In [16]:
print(opp_df.shape)
print(opt_df.shape)

(32434489, 4)
(1384617, 4)

Orders DF has been built and shapes confirmed.

In [0]:
prod_df = pd.read_csv('products.csv')

In [18]:
prod_df.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
prod_ls = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries',
           'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado',
           'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']
condition = prod_df['product_name'].isin(prod_ls)

In [20]:
popular_products = prod_df[condition]
popular_products.head(10)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

Now we have a df of only the most popular products (along with a few extra columns).

In [21]:
popular_products = popular_products.drop(['aisle_id', 'department_id'], axis=1)
popular_products.head(10)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

Perfect! Now to grab the counts from the orders df:

In [22]:
popular_products['orders'] = (popular_products['product_id']
                              .apply(lambda id: order_products['product_id']
                              .value_counts().loc[id]))
popular_products.head(10)

       product_id            product_name  orders
13175       13176  Bag of Organic Bananas  394930
16796       16797            Strawberries  149445
21136       21137    Organic Strawberries  275577
21902       21903    Organic Baby Spinach  251705
24851       24852                  Banana  491291
26208       26209                   Limes  146660
27844       27845      Organic Whole Milk  142813
47208       47209    Organic Hass Avocado  220877
47625       47626             Large Lemon  160792
47765       47766         Organic Avocado  184224

In [23]:
(popular_products.sort_values(by=['orders'], ascending=False)
                 .reset_index(drop=True)
                 .drop(['product_id'], axis=1))

             product_name  orders
0                  Banana  491291
1  Bag of Organic Bananas  394930
2    Organic Strawberries  275577
3    Organic Baby Spinach  251705
4    Organic Hass Avocado  220877
5         Organic Avocado  184224
6             Large Lemon  160792
7            Strawberries  149445
8                   Limes  146660
9      Organic Whole Milk  142813

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [24]:
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [25]:
# table2 -> tidy
tidy2 = table2.reset_index().melt(id_vars='index', value_vars=[col for col in table2.columns])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [26]:
tidy2 = tidy2.rename(columns={
    'index': 'trt',
    'variable': 'name',
    'value': 'result'
})
tidy2['trt'] = tidy2['trt'].str.replace('treatment', '')
tidy2

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [27]:
# tidy -> table2
wide2 = tidy2.pivot_table(index='trt', columns='name', values='result')
wide2

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [29]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [30]:
# Flights Pivot Table
flights_pivot = flights.pivot_table(index='year',
                                    columns='month',
                                    values='passengers')
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [80]:
##### YOUR CODE HERE #####
order_counts = order_products['product_id'].value_counts() > 2900
popular = (order_counts[order_counts].to_frame()
           .reset_index()
           .drop(['product_id'], axis=1)
           .rename(columns={'index': 'product_id'}))
popular

      product_id
0          24852
1          13176
2          21137
3          21903
4          47209
...          ...
2046       38533
2047       35734
2048       21038
2049       44787
2050        2447

[2051 rows x 1 columns]

In [81]:
condition = order_products['product_id'].isin(popular['product_id'])

popular_products = order_products[condition]

popular_products.head(10)

    order_id  product_id  add_to_cart_order  reordered
0          2       33120                  1          1
1          2       28985                  2          1
2          2        9327                  3          0
5          2       17794                  6          1
9          3       33754                  1          1
10         3       24838                  2          1
12         3       21903                  4          1
14         3       46667                  6          1
15         3       17461                  7          1
16         3       32665                  8          1

Now that we have identified all of the individual orders that contained the popular products, we can drop the extra columns and feed in the order info (time of day, etc).

In [0]:
popular_products = popular_products.drop(['add_to_cart_order', 'reordered'], axis=1)

In [0]:
orders = pd.read_csv('orders.csv')

In [84]:
popular_orders = orders.merge(popular_products, on='order_id', how='right')
popular_orders.head(12)

    order_id  user_id  ... days_since_prior_order  product_id
0    2539329        1  ...                    NaN         196
1    2539329        1  ...                    NaN       14084
2    2539329        1  ...                    NaN       12427
3    2398795        1  ...                   15.0         196
4    2398795        1  ...                   15.0       12427
5    2398795        1  ...                   15.0       13176
6    2398795        1  ...                   15.0       13032
7     473747        1  ...                   21.0         196
8     473747        1  ...                   21.0       12427
9     473747        1  ...                   21.0       25133
10    473747        1  ...                   21.0       30450
11   2254736        1  ...                   29.0         196

[12 rows x 8 columns]

Let's remove a few more extra columns:

In [85]:
popular_orders = popular_orders.drop(['user_id', 'eval_set', 'order_number', 'order_dow', 'days_since_prior_order'], axis=1)
popular_orders

          order_id  order_hour_of_day  product_id
0          2539329                  8         196
1          2539329                  8       14084
2          2539329                  8       12427
3          2398795                  7         196
4          2398795                  7       12427
...            ...                ...         ...
22450881   2977660                 12       31477
22450882    272231                 14        6846
22450883    272231                 14        9405
22450884    272231                 14       24852
22450885    272231                 14       39216

[22450886 rows x 3 columns]

In [0]:
latest_prod_df = popular_orders.groupby(['product_id']).mean().sort_values('order_hour_of_day', ascending=False)[:25]

In [88]:
latest_prod_df = latest_prod_df.drop(['order_id'], axis=1).reset_index()
latest_prod_df

    product_id  order_hour_of_day
0        30668          14.526986
1        45541          14.526299
2        45681          14.394912
3        46175          14.388942
4        14335          14.373308
5        38374          14.369711
6        38003          14.306421
7        28682          14.303480
8        48523          14.292018
9        47993          14.270300
10       40002          14.268841
11       21463          14.257849
12       17334          14.256280
13       45368          14.248191
14       20754          14.233542
15       13885          14.224069
16       12276          14.204325
17        2361          14.189235
18       47652          14.156069
19       38563          14.134992
20       22620          14.120449
21        8638          14.104662
22       41319          14.083895
23        4932          14.039406
24       27179          14.027699

In [89]:
latest_prod_df = latest_prod_df.merge(prod_df, on='product_id', how='left')
latest_prod_df

    product_id  order_hour_of_day  ... aisle_id  department_id
0        30668          14.526986  ...       37              1
1        45541          14.526299  ...       37              1
2        45681          14.394912  ...       37              1
3        46175          14.388942  ...       37              1
4        14335          14.373308  ...       37              1
5        38374          14.369711  ...       37              1
6        38003          14.306421  ...       37              1
7        28682          14.303480  ...       37              1
8        48523          14.292018  ...       37              1
9        47993          14.270300  ...       37              1
10       40002          14.268841  ...       37              1
11       21463          14.257849  ...       37              1
12       17334          14.256280  ...       37              1
13       45368          14.248191  ...       37              1
14       20754          14.233542  ...       37              1
15       13885          14.224069  ...       37              1
16       12276          14.204325  ...       37              1
17        2361          14.189235  ...       37              1
18       47652          14.156069  ...       37              1
19       38563          14.134992  ...       37              1
20       22620          14.120449  ...       37              1
21        8638          14.104662  ...       37              1
22       41319          14.083895  ...       37              1
23        4932          14.039406  ...       37              1
24       27179          14.027699  ...       79              1

[25 rows x 5 columns]

Looking pretty good!  The assignment asks to 'replace the list' so here it is as a list:

In [90]:
[prod for prod in latest_prod_df['product_name']]

['Half Baked Frozen Yogurt',
 'The Tonight Dough™ Ice Cream',
 'Americone Dream® Ice Cream',
 'Half Baked® Ice Cream',
 'Phish Food® Ice Cream',
 'Milk and Cookies Ice Cream',
 'Sicilian Pistachio',
 'Chocolate Peanut Butter Cup Gelato',
 'Birthday Cake Light Ice Cream',
 'Cherry Garcia Ice Cream',
 'Strawberry Ice Cream',
 'Vanilla Bean Light Ice Cream',
 'Coffee Ice Cream',
 'Roman Raspberry Sorbetto',
 'Mediterranean Mint Gelato',
 'Caramel Cookie Crunch Gelato',
 'Chocolate Chip Cookie Dough Ice Cream',
 'Mint Chip',
 'Coconut Almond Minis Frozen Dessert Bars',
 'Mint Chocolate Chip Ice Cream',
 'Chocolate Peanut Butter Ice Cream',
 'Vanilla Milk Chocolate Almond Ice Cream Bars',
 'Sea Salt Caramel Gelato',
 'Vanilla Bean Ice Cream',
 'Rising Crust Pepperoni Pizza']

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####